In [1]:
import pandas as pd

Criar o DataFrame puxando a planilha Excel

In [9]:
df = pd.read_excel('EB_Vendas.xlsx')

In [21]:
df.dtypes

Cidade             object
Data       datetime64[ns]
Vendas            float64
Loja                int64
Qtde                int64
Receita           float64
dtype: object

In [11]:
df.count()

Cidade     50
Data       50
Vendas     50
Loja       50
Qtde       50
Receita    50
dtype: int64

In [4]:
df.groupby('Cidade')['Vendas'].sum()  # soma os valores da coluna "Vendas" de cada cidade

Cidade
Aracaju       243.76
Fortaleza     430.07
Natal        2570.21
Recife        674.64
Salvador     1594.87
Name: Vendas, dtype: float64

In [14]:
df.groupby('Cidade')['Loja'].size()   # soma a quantidade de itens da coluna "loja" (pode ser qualquer coluna)

Cidade
Aracaju       5
Fortaleza     7
Natal        15
Recife        7
Salvador     16
Name: Loja, dtype: int64

In [56]:
df.groupby([df['Data'].dt.year, df['Cidade']])['Vendas'].sum()

Data  Cidade
2018  Aracaju       243.76
      Natal         995.00
2019  Fortaleza     430.07
      Natal        1575.21
      Recife        674.64
      Salvador     1594.87
Name: Vendas, dtype: float64

In [47]:
df.loc[df.Loja == 854]

   Cidade       Data  Vendas  Loja  Qtde  Receita
35  Natal 2018-02-01   432.0   854     3   1296.0

In [60]:
f1 = df.Data.dt.year == 2019
f2 = df.Cidade == 'Natal'
f3 = df.Loja == 1036
f4 = df.Receita > 100.00
df.loc[f1 & f2 & f3 & f4]

   Cidade       Data  Vendas  Loja  Qtde  Receita
20  Natal 2019-01-02  151.45  1036     2   302.90
22  Natal 2019-01-02  188.79  1036     3   566.37